//! Що таке ЦИКЛ?
//? ЦИКЛ - керуюча конструкція, призначена для організації
//? багаторазового виконання набору інструкцій.

//? ТІЛО ЦИКЛУ - послідовність інструкцій,
//? призначена для багаторазового виконання.

//? ІТЕРАЦІЯ - одноразове виконання тіла циклу.

//? УМОВА ВИХОДУ - вираз, що визначає, чи буде
//? в черговий раз виконуватися ітерація,
//? або цикл завершиться.

//? ЛІЧИЛЬНИК - змінна, що зберігає поточний номер ітерації.
//? Цикл не обов'язково містить ЛІЧИЛЬНИК,
//? і він не повинен бути один, умова виходу з циклу може
//? залежати від декількох змінних, що змінюються в циклі.



//! 1.Цикл while - цикл з передумовою
console.warn("https://ruslan379.github.io/course-fe-html-css/lesson-FE3_06/images/while.png");
//? — цикл, який виконується, доки правдива якась умова,
//? зазначена ДО його початку.
//? Ця умова перевіряється ДО виконання тіла циклу,
//? тому тіло може не виконатися жодного разу, 
//? якщо умова від самого початку - хибна.
let counter = 0;
counter = 4; //? після перевірки умови(хибна) - цикл НЕ виконається
// let counter2 = 0;

while (counter < 4) {
    console.log("ТІЛО ЦИКЛУ --> counter(ДО):", counter);
    counter += 1;
    console.log("ТІЛО ЦИКЛУ --> counter(ПІСЛЯ):", counter);
};

console.log("____ ПОЗА ЦИКЛУ --> counter:", counter);
console.log("-----------------------------------------");


//? ПРИКЛАД:
let clientCounter = 18;
// clientCounter = 30; //? після перевірки умови(хибна) - цикл НЕ виконається
const maxClients = 26;

while (clientCounter < maxClients) {
    console.log("ТІЛО ЦИКЛУ --> clientCounter(ДО):", clientCounter);
    clientCounter += 1;
    console.log("ТІЛО ЦИКЛУ --> clientCounter(ПІСЛЯ):", clientCounter);
};
console.log("____ ПОЗА ЦИКЛУ --> clientCounter:", clientCounter);
console.log("-----------------------------------------");



//! 2.Цикл do...while - цикл з постумовою
console.warn("https://ruslan379.github.io/course-fe-html-css/lesson-FE3_06/images/do-while.png");
//? - цикл, в якому умова перевіряється ПІСЛЯ виконання тіла циклу.
//? З цього випливає, що тіло завжди виконується хоча б один раз.
let counter1 = 4;
// counter = 4; //? після перевірки умови(хибна) - цикл виконається ОДИН раз

do {
    console.log("ТІЛО ЦИКЛУ --> counter1(ДО):", counter1);
    counter1 += 1;
    console.log("ТІЛО ЦИКЛУ --> counter1(ПІСЛЯ):", counter1);
} while (counter1 < 4);

console.log("____ ПОЗА ЦИКЛУ --> counter1:", counter1);
console.log("-----------------------------------------");

// let question = prompt("ведіть будь-ласка 3 символи")

// let number;

// do {
//     const string = prompt("ведіть будь-ласка 3 символи")
//     console.log("string:", string)
//     number = string.length
//     console.log("number:", number)
// } while (number <= 3)

// console.log("Продовження коду")
// // console.log("question.length:", question.length)
// // console.log("typeof question:", typeof question)



//? ПРИКЛАД:
// let password = "";

// do {
//     password = prompt("Введіть пароль довший 4-х символів");
// } while (password.length < 5);

// console.log("Ви ввели пароль: ", password);
// alert(`Ви ввели пароль:  ${password}`);



//! 3.Цикл for - цикл з лічильником
//? - цикл, в якому певна змінна змінює своє значення
//? із заданого початкового до кінцевого значення
//? з деяким кроком, і для кожного значення цієї змінної
//? тіло циклу виконується один раз.
let initialization;
let condition;
let postExpression;

for (initialization; condition; postExpression) {
    // statements
}

//? Алгоритм виконання циклу for:

//? Ініціалізація(initialization) - виконується один раз до початку циклу.
//? Використовується для створення змінної - лічильника
//? і зазначення її початкового значення.

//? Умова(condition) - вираз, що оцінюється
//? перед кожною ітерацією(повторенням) циклу.
//? Тіло циклу виконується тільки тоді,
//? коли вираз приводиться до true.
//? Цикл завершується, якщо значення буде false.

//? Тіло(statements) - набір інструкцій для виконання на кожному повторенні.
//? Виконується, якщо вираз умови приводиться до true.

//? Пост - вираз(post - expression) - виконується в кінці
//? кожного повторення циклу, до перевірки умови.
//? Використовується для оновлення змінної - лічильника.

//? ПРИКЛАД-1:
for (let i = 0; i <= 20; i += 5) {
    console.log("Лічильник, i:", i);
};
console.log("-----------------");



//? ПРИКЛАД-2:
const target = 3;
let sum = 0;

for (let i = 0; i <= target; i += 1) {
    sum += i;
    console.log("Тіло for, i =", i);
    console.log("Тіло for, sum =", sum);
    console.log(". . . . . . . . .");
};

console.log("sum:", sum);
console.log("------------------");


//? ПРИКЛАД-3:
const max = 10;
for (let i = 0; i < max; i += 1) {
    console.log("i =", i);
    console.log(`${max} % ${i} = `, max % i);
};
console.log("-----------------");



//! 4.Інструкції break і continue

//! Оператор break
//? Перервати виконання циклу можна в будь-який момент. 
//? Для цього існує оператор break, 
//? який повністю припиняє виконання циклу 
//? і передає управління на рядок після його тіла.
for (let i = 0; i <= 5; i += 1) {
    console.log("i:", i);

    if (i === 3) {
        console.log("Знайшли число 3, перериваємо виконання циклу");
        break;
    }
};

console.log("Лог після циклу");
console.log("------------------");



//! Оператор continue
//? Перериває не увесь цикл, а тільки
//? виконання поточної ітерації.
//? Його використовують, якщо зрозуміло,
//? що на поточній ітерації циклу більше
//? немає що робити або взагалі не потрібно нічого робити,
//? і час переходити до наступної ітерації.
const number = 10;

for (let i = 0; i < number; i += 1) {
    console.log("for --> i:", i);
    if (i % 2 === 0) {
        // console.log("if --> i:", i);
        continue;
    };

    console.log("Непарне i: ", i); // 1, 3, 5, 7, 9
    console.log(". . . . . . .");
};

