//! Стрілкові(cтрілочні) функції
console.warn("Стрілкові(cтрілочні) функції:");
//? Стрілочні функції мають скорочений, лаконічніший синтаксис,
//? що зменшує обсяг коду, особливо коли функція маленька
//? або якщо вона використовується як колбек.
//? Усі стрілки створюються як функціональний вираз (function expression),
//? і якщо функція - не анонімна, її необхідно присвоювати змінній.
//todo: Звичайне оголошення функції:
function classicAdd(a, b, c) {
    return a + b + c;
};
console.log("classicAdd(1, 2, 3);", classicAdd(1, 2, 3)); //! 6
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");

//? Якщо у стрілковій функції є декілька параметрів ,
//? то вони перераховуються через кому в круглих дужках,
//? так само, як в приладі з function classicAdd(a, b, c),
//? між знаками дорівнює = та стрілкою =>.
//todo: Оголошення функції стрілочною функцією (декілька параметрів):
const arrowAdd = (a, b, c) => {
    return a + b + c;
};
console.log("arrowAdd(10, 20, 30);", arrowAdd(10, 20, 30)); //! 60
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");

const arrowAdd22 = function (a, b, c) {
    return a + b + c;
}

//? Якщо параметр один, його можна оголошувати без круглих дужок.
//todo: Оголошення функції стрілочною функцією (один параметр):
const add = a => {
    return a + 5;
};
console.log("add(10);", add(10)); //! 15
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");


//? Якщо параметри відсутні, то обов'язково повинні бути порожні круглі дужки..
//todo: Оголошення функції стрілочною функцією (параметри відсутні):
const greet = () => {
    return "Привіт!"
};

console.log("greet();", greet()); //! 15
console.log("-------------------------------------------------------");



//! Явне повернення
console.warn("Явне повернення:");
//? Якщо є фігурні дужки, і функція повинна повертати якесь значення, 
//? необхідно явно поставити return. 
//? Це називається явне повернення (explicit return). 
//? Такий синтаксис використовується у разі, 
//? якщо в тілі функції потрібно виконати ще якісь інструкції, 
//? крім повернення значення.
const arrowAdd2 = (a, b, c) => {
    console.log(a, b, c);
    return a + b + c;
};
console.log("arrowAdd2(100, 200, 300);", arrowAdd2(100, 200, 300)); //! 600
console.log("-------------------------------------------------------");


//! Неявне повернення
console.warn("Неявне повернення:");
//? Якщо фігурні дужки відсутні,
//? то повертається результат виразу,
//? який стоїть після =>.
//? Це називається неявне повернення (implicit return).
//?  У прикладі повернеться результат виразу додавання параметрів a, b і c.
const arrowAdd3 = (a, b, c) => a + b + c;
console.log("arrowAdd2(1000, 2000, 3000);", arrowAdd2(1000, 2000, 3000)); //! 6000
console.log("-------------------------------------------------------");


//! Псевдомасив arguments
console.warn("Псевдомасив arguments:");
//? У стрілочних функцій НЕМАЄ локальної змінної arguments, 
//? що містить усі аргументи. 
//? Якщо необхідно зібрати всі аргументи в масив, 
//? використовується операція rest.
const add4 = (...args) => {
    console.log("args:", args);
};

add4(1, 2, 3); //! args: [1, 2, 3]
console.log("-------------------------------------------------------");



//! Стрілкові функції як колбеки
console.warn("Приклад-1: Анонімні стрілкові функції як колбеки:");
//? Анонімні стрілочні функції відмінно підходять
//? як колбеки для перебираючих методів масиву
//? завдяки коротшому синтаксису оголошення,
//? особливо, якщо не потрібне тіло функції.
const numbers1 = [5, 10, 15, 20, 25];

//todo: Оголошення функції
//todo: Виклик функції з оголошенням функції як колбек
numbers1.forEach(function (number, index) {
    console.log(`Індекс: ${index}, значення: ${number}`);
});
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . .");

//todo: Анонімна стрілочна функція
//todo: Виклик функції з анонімною стрілочною функцією як колбек
numbers1.forEach((number, index) => {
    console.log(`Індекс: ${index}, значення: ${number}`);
});
console.log("-------------------------------------------------------");


console.warn("Приклад-2: Стрілкові функції як колбеки:");
//? Стрілочну колбек-функцію також можна оголошувати окремо 
//? і передавати на неї посилання. 
//? Це варто робити, якщо одна функція використовується 
//? у декількох місцях програми або якщо вона громіздка.
const numbers2 = [5, 10, 15, 20, 25];

const logMessage = (number, index) => {
    console.log(`Індекс ${index}, значення ${number}`);
};

//todo: Виклик функції зі стрілочною функцією як колбек
numbers2.forEach(logMessage);
console.log("-------------------------------------------------------");


//! Фільтрація масиву з використанням стрілкової функції
//? Напишемо функцію фільтрації елементів масиву. 
//? Перший параметр array це масив,
//? будемо перебирати його використовуючи цикл for...of.
//? Другий параметр callbackTest це callback-функція, 
//? яка виконується для кожного елемента масиву.
let result1;
let result2;

const filter = (array, callbackTest) => {
    const filteredArray = [];

    for (const item of array) {
        console.log("item:", item);
        const passed = callbackTest(item);

        if (passed) {
            filteredArray.push(item);
        };
    };

    return filteredArray;
};

console.warn("Приклад-1_1. \n  Використання стрілкової функції як колбек:");
const callback1 = value => value >= 3;
//todo: Виклик функції зі стрілочною функцією як колбек:
result1 = filter([1, 2, 3, 4, 5], callback1);
console.log("result1:", result1);
console.log(". . . . . . . . . . . . .");

console.warn("Приклад-1_2. \n  Використання анонімної стрілкової функції як колбек:");
//todo: Виклик функції з анонімною стрілочною функцією як колбек:
result1 = filter([1, 2, 3, 4, 5], (value) => value >= 3);
console.log("result1:", result1);
console.log(". . . . . . . . . . . . .");





console.warn("Приклад-2_1. \n  Використання стрілкової функції як колбек:");
const callback2 = value => value <= 4;
//todo: Виклик функції зі стрілочною функцією як колбек:
result2 = filter([1, 2, 3, 4, 5, 6, 7, 8], callback2);
console.log("result2:", result2);
console.log(". . . . . . . . . . . . . .");

console.warn("Приклад-2_2. \n  Використання анонімної стрілкової функції як колбек:");
//todo: Виклик функції з анонімною стрілочною функцією як колбек:
result2 = filter([1, 2, 3, 4, 5, 6, 7, 8], (value) => value <= 4);
console.log("result2:", result2);
console.log("----------------------------");



//? Замінити в функції "Приготування меленої кави"
//? функцію "Приготування меленої кави" та
//? функцію "Приготування окропу (гарячої води)"
//? на стрілкові функції та використати їх як колбеки.

//? Замінити в функції "Приготування меленої кави"
//? функцію "Приготування меленої кави" та
//? функцію "Приготування окропу (гарячої води)"
//? на анонімні стрілкові функції з неявним поверненням
//? та використати їх як колбеки.



let groundCoffee;
let hotWater;
let coffee;

// //! 1 - функція "Приготування меленої кави"
// const makesGroundCoffee = () => {
//     groundCoffee = "30 грам";
//     console.log("1️⃣ Мелена кава є?", Boolean(groundCoffee));
//     return groundCoffee;
// };



// //! 2 - функція "Приготування окропу (гарячої води)".
// const makesHotWater = () => {
//     hotWater = "250 мілілітрів";
//     console.log("2️⃣ Окріп (гаряча вода) є?", Boolean(hotWater));
//     return hotWater;
// };

// //! 3 - функція "Приготування кави"
// const makingCoffee = (callback1, callback2) => {
//     if (!(callback1())) {
//         return "Потрібна мелена кава!";
//     };

//     if (!(callback2())) {
//         return "Потрібна гаряча вода!";
//     };

//     coffee = groundCoffee + hotWater;
//     coffee = "✅ Кава готова!"
//     return coffee;
// };

// console.log(makingCoffee(makesGroundCoffee, makesHotWater));
// console.log("--------------------------------------------");


//? Замінити в функції "Приготування меленої кави"
//? функцію "Приготування меленої кави" та
//? функцію "Приготування окропу (гарячої води)"
//? на анонімні стрілкові функції з неявним поверненням
//? та використати їх як колбеки.


//! 1 - функція "Приготування меленої кави"
const makesGroundCoffee = grndCoffee => grndCoffee




//! 2 - функція "Приготування окропу (гарячої води)".
const makesHotWater = hWater => hWater 



//! 3 - функція "Приготування кави"
const makingCoffee = (callback1, callback2) => {
    if (!(callback1("30 грам"))) {
        return "Потрібна мелена кава!";
    };

    if (!(callback2("250 мілілітрів"))) {
        return "Потрібна гаряча вода!";
    };

    coffee = groundCoffee + hotWater;
    coffee = "✅ Кава готова!"
    return coffee;
};

console.log(makingCoffee(grndCoffee => grndCoffee, hWater => hWater));
console.log("--------------------------------------------");


//? Замінити в функції "останнього дз"
//? на анонімні стрілкові функції з неявним поверненням
//? та використати їх як колбеки.